app/controllers/blog_controller.rb

	def admin
		@articles = Article.search( params[:q] ).order( sort_column + " " + sort_dir ).paginate( :per_page => 10, :page => params[:page] )
---
SELECT `articles`.* FROM `articles` WHERE (publish_at <= '2011-02-01 03:16:03' and status = 'publish') ORDER BY publish_at desc

	def index
		if @tag = params[:tag]
            @articles = Article.tagged_with( @tag ).published.paginate :order => "publish_at desc", :page => params[:page], :per_page => 10
---
SELECT `articles`.* FROM `articles` WHERE (publish_at <= '2011-01-20 22:27:52' and status = 'publish') ORDER BY publish_at desc
SELECT tags.*, COUNT(*) AS count FROM `tags` LEFT OUTER JOIN taggings ON tags.id = taggings.tag_id AND taggings.context = 'topics' INNER JOIN articles ON articles.id = taggings.taggable_id WHERE (taggings.taggable_type = 'Article') AND (taggings.taggable_id IN(SELECT articles.id FROM `articles`)) GROUP BY tags.id, tags.name HAVING COUNT(*) > 0