app/controllers/checkins_controller.rb

INSERT INTO `checkins` (`confirmed_at`, `confirmed_by`, `content`, `created_at`, `objective_id`, `status`, `updated_at`, `user_id`) VALUES (NULL, NULL, NULL, '2011-01-21 23:52:52', 1, 'did', '2011-01-21 23:52:52', 3)
INSERT INTO `activities` (`activity_type`, `actor_id`, `actor_type`, `created_at`, `status`, `target_id`, `target_type`, `updated_at`, `verb`) VALUES (NULL, 3, 'User', '2011-01-21 23:52:52', 'active', 1, 'Objective', '2011-01-21 23:52:52', 'did ')
---
	def create
		@checkin = @current_user.checkins.new( params[:checkin] )
		if @checkin.save
			if @checkin.objective_assignment.present?
				if @checkin.done?
					activity = @checkin.user.do_activity( "did '#{@checkin.objective_assignment.objective.name}' ", @checkin )
				else
					activity = @checkin.user.do_activity( "did not '#{@checkin.objective_assignment.objective.name}' ", @checkin )
				end
				# -- auto-add content as comment
				if @checkin.content.present?
					activity.comments.create :user => @current_user, :content => @checkin.content