app/controllers/children_controller.rb

	def create
		@child = Child.new params[:child]
		if @child.save
			relation = @current_user.relations.new :role => params[:child][:role], :child_id => @child.id
			if params[:child][:welcome_message].present?
				msg = Message.create :sender => @current_user, :recipient => @child,
						:subject => "Welcome, #{@child.name}!",
						:content => params[:child][:welcome_message], :points => 10
---
INSERT INTO `messages` (`content`, `created_at`, `points`, `recipient_id`, `recipient_type`, `sender_id`, `sender_type`, `subject`, `updated_at`) VALUES ('Welcome Bob!', '2011-01-22 00:03:53', 10, 4, 'User', 2, 'User', 'Welcome, Bob!', '2011-01-22 00:03:53')
INSERT INTO `relations` (`child_id`, `created_at`, `role`, `status`, `updated_at`, `user_id`) VALUES (4, '2011-01-22 00:03:53', 'father', NULL, '2011-01-22 00:03:53', 2)
INSERT INTO `users` (`activated_at`, `activation_code`, `bio`, `birthday`, `cached_slug`, `created_at`, `email`, `gender`, `hashed_password`, `invitation_code`, `last_ip`, `level`, `name`, `orig_ip`, `points_balance`, `points_earned`, `registered_by_id`, `remember_token`, `remember_token_expires_at`, `salt`, `score`, `status`, `type`, `updated_at`, `website_name`, `website_url`) VALUES (NULL, NULL, NULL, '2001-01-10 08:00:00', NULL, '2011-01-22 00:03:52', NULL, 'male', '0c4e839c2100760ebae5cd22468b0442b9c52980', NULL, NULL, 0, 'Bob', NULL, 0, 0, NULL, NULL, NULL, '21734492200.5057971051355792', 0, 'first', 'Child', '2011-01-22 00:03:52', NULL, NULL)