app/controllers/contacts_controller.rb

	def create
		@contact = Contact.new( params[:contact] )
		@contact.ip = request.ip
		if @current_user.anonymous?
			if user = User.find_by_email( @contact.email )
				@contact.user = user
				@contact.save
---
INSERT INTO `contacts` (`content`, `crash_id`, `created_at`, `email`, `ip`, `site_id`, `subject`, `updated_at`) VALUES (NULL, NULL, '2011-02-01 03:13:59', 'kjhhkjh@dfsdfkj', '127.0.0.1', NULL, NULL, '2011-02-01 03:13:59')