app/controllers/messages_controller.rb

SELECT `users`.* FROM `users` WHERE (`users`.`id` = 2) LIMIT 1
INSERT INTO `messages` (`content`, `created_at`, `points`, `recipient_id`, `recipient_type`, `sender_id`, `sender_type`, `subject`, `updated_at`) VALUES ('I\'m proud of you for eating so well today!', '2011-01-22 00:06:10', 5, 4, 'User', 2, 'User', 'Great Job', '2011-01-22 00:06:10')
UPDATE `users` SET `points_balance` = 25, `points_earned` = 15, `updated_at` = '2011-01-22 00:06:10' WHERE (`users`.`type` = 'Child') AND (`users`.`id` = 4)
---
	def create
		dfs
		@message = Message.new params[:message]
		@message.sender = @current_user
		@message.recipient = User.find_by_id( params[:message][:recipient_id] )
		if @message.save