app/controllers/objectives_controller.rb

	def create
		@objective = Objective.new params[:objective]
		if @objective.save
			@assigned_user = User.find( params[:objective][:user_id] )
			@objective.assignments.create :user_id => @assigned_user.id, :assigned_by_id => @current_user
---
INSERT INTO `objectives` (`created_at`, `creator_id`, `description`, `due_at`, `level`, `name`, `objective_type`, `period`, `points`, `req_checkin`, `req_confirm`, `times`, `updated_at`) VALUES ('2011-01-21 23:52:36', NULL, '', NULL, NULL, 'Brush your Teeth', 'recurring', 'day', 10, 1, 0, 2, '2011-01-21 23:52:36')
SELECT `users`.* FROM `users` WHERE (`users`.`id` = 2) LIMIT 1
INSERT INTO `assignments` (`assigned_by_id`, `created_at`, `objective_id`, `updated_at`, `user_id`) VALUES (1, '2011-01-21 23:52:37', 1, '2011-01-21 23:52:37', 3)