app/controllers/questions_controller.rb

	def answer
		# get stuff
		@question = Question.find( params[:id] )
		if @answer = Answer.find_by_id( params[:answer_id] )
---
SELECT `questions`.* FROM `questions` WHERE (`questions`.quiz_id = 2) ORDER BY seq DESC LIMIT 1
SELECT `answers`.* FROM `answers` WHERE (`answers`.`id` = 21) LIMIT 1

	def show
		@question = Question.find( params[:id] )
---
SELECT `questions`.* FROM `questions` WHERE (`questions`.`id` = 5) LIMIT 1