app/controllers/quizzes_controller.rb

SELECT `quizzings`.* FROM `quizzings` WHERE (`quizzings`.quiz_id = 2) AND (`quizzings`.`user_id` = 4) AND (`quizzings`.`quiz_id` = 2) LIMIT 1
SELECT COUNT(*) AS count_id FROM (SELECT 1 FROM `questions` WHERE (`questions`.quiz_id = 2)) AS subquery
UPDATE `quizzings` SET `score` = 7, `updated_at` = '2011-01-22 00:15:31' WHERE (`quizzings`.`id` = 1)
UPDATE `users` SET `points_balance` = 102, `points_earned` = 102, `updated_at` = '2011-01-22 00:15:31' WHERE (`users`.`type` = 'Child') AND (`users`.`id` = 4)
SELECT `answerings`.* FROM `answerings` WHERE (`answerings`.quizzing_id = 1)
SELECT `answers`.* FROM `answers` WHERE (`answers`.question_id = 5 AND (correct = true)) LIMIT 1
SELECT `questions`.* FROM `questions` WHERE (`questions`.`id` = 5) LIMIT 1
SELECT `users`.* FROM `users` WHERE (`users`.`id` = 4) LIMIT 1
---
	def recap
		@quiz = Quiz.find( params[:id] )
		@quizzing = @quiz.quizzings.find_by_user_id_and_quiz_id( @current_user, @quiz )

		@num_right = @quizzing.answerings.collect{ |a| a.answer == a.question.correct_answer }.count { |a| a == true }

		@quizzing.update_attributes :score => @num_right
		@points_earned = ( @num_right.to_f / @quiz.questions.count.to_f ) * @quiz.points.to_f