app/controllers/relations_controller.rb

SELECT `users`.`id` FROM `users` WHERE (`users`.`email` = BINARY 'gma@gmail.com') LIMIT 1
UPDATE `users` SET `activated_at` = NULL, `activation_code` = NULL, `bio` = NULL, `birthday` = NULL, `cached_slug` = 'grandma', `created_at` = '2011-01-22 00:17:04', `email` = 'gma@gmail.com', `gender` = NULL, `hashed_password` = 'f6066a2edb34f9d48486e4859e808e5f1ac47cc0', `invitation_code` = NULL, `last_ip` = NULL, `level` = 0, `name` = 'Grandma', `orig_ip` = NULL, `points_balance` = 0, `points_earned` = 0, `registered_by_id` = NULL, `remember_token` = NULL, `remember_token_expires_at` = NULL, `salt` = '21727865400.6474179518219826', `score` = 0, `status` = 'first', `type` = NULL, `updated_at` = '2011-01-22 00:17:04', `website_name` = NULL, `website_url` = NULL WHERE (`users`.`id` = 5)
INSERT INTO `relations` (`child_id`, `created_at`, `role`, `status`, `updated_at`, `user_id`) VALUES (4, '2011-01-22 00:17:04', 'grandmother', NULL, '2011-01-22 00:17:04', 5)
INSERT INTO `users` (`activated_at`, `activation_code`, `bio`, `birthday`, `cached_slug`, `created_at`, `email`, `gender`, `hashed_password`, `invitation_code`, `last_ip`, `level`, `name`, `orig_ip`, `points_balance`, `points_earned`, `registered_by_id`, `remember_token`, `remember_token_expires_at`, `salt`, `score`, `status`, `type`, `updated_at`, `website_name`, `website_url`) VALUES (NULL, NULL, NULL, NULL, NULL, '2011-01-22 00:17:04', 'gma@gmail.com', NULL, 'f6066a2edb34f9d48486e4859e808e5f1ac47cc0', NULL, NULL, 0, 'Grandma', NULL, 0, 0, NULL, NULL, NULL, '21727865400.6474179518219826', 0, 'first', NULL, '2011-01-22 00:17:04', NULL, NULL)
---
	def create
		@relation = Relation.new( params[:relation] )
		@related_user = User.find_or_initialize_by_email( :email => @relation.email, :name => @relation.name, :password => '1234' )
		# todo -- send email with invitation code
		# user clicks link, gets looked up by invite code and asked to change pass
		# for now, set new user's pass to '1234' like everyone else's
		@related_user.password = '1234'
		@related_user.save
		@relation.user = @related_user

		if @relation.save