app/controllers/sessions_controller.rb

	def destroy
		if @current_user
			user = User.find_by_id @current_user.id
---
SELECT `users`.* FROM `users` WHERE (`users`.`id` = 2) LIMIT 1