app/controllers/site_controller.rb

	def index
		@activities = Activity.feed Site.first
---
SELECT `activities`.* FROM `activities` WHERE (`activities`.target_id = 1 AND `activities`.target_type = 'Site')
SELECT `sites`.* FROM `sites` LIMIT 1