app/controllers/site_controller.rb

	def index
		# todo - implement site activities
		# @activities = Activity.feed Site.first
		@title = "Welcome"
		@articles = Article.published.order( 'publish_at asc' )
---
SELECT `articles`.* FROM `articles` WHERE (publish_at <= '2011-02-01 03:12:46' and status = 'publish') ORDER BY publish_at asc