app/controllers/unlockables_controller.rb

	def edit
		@unlockable = Unlockable.find params[:id]
---
SELECT `unlockables`.* FROM `unlockables` WHERE (`unlockables`.`id` = 8) LIMIT 1

	def unlock
		@unlockable = Unlockable.find params[:id]
---
SELECT `unlockables`.* FROM `unlockables` WHERE (`unlockables`.`id` = 5) LIMIT 1

	def create
		if asin = params[:unlockable][:asin]
			search_index = params[:unlockable][:search_index]
			@unlockable = Unlockable.create_from_amazon( asin, search_index )
---
INSERT INTO `unlockables` (`asin`, `created_at`, `description`, `level`, `name`, `objective_id`, `points`, `updated_at`) VALUES (NULL, '2011-01-22 00:09:25', 'Get busy building! This jam-packed tub features an extensive assortment of LEGO bricks and other fun elements. It includes a building plate, mini figure, windows, doors and wheels. New container allows for easy clean-up and efficient storage. The transparent lid lets builders display their models. Includes building instructions for five models and photo inspiration for 25 more. 405 pieces. Tub measures 7.56\"H x 15.12\"W x 8.98\"D.', 0, 'LEGO Ultimate Building Set - 405 Pieces (6166)', NULL, NULL, '2011-01-22 00:09:25')

	def update
		@unlockable = Unlockable.find params[:id]
		if @unlockable.update_attributes params[:unlockable]
---
SELECT `unlockables`.* FROM `unlockables` WHERE (`unlockables`.`id` = 8) LIMIT 1
UPDATE `unlockables` SET `points` = 500, `updated_at` = '2011-01-22 00:09:33' WHERE (`unlockables`.`id` = 8)