app/controllers/users_controller.rb

	def show
		@user = User.find( params[:id] )
---
SELECT `users`.* FROM `users` WHERE (`users`.`id` = 2) LIMIT 1