app/views/activities/_activity.html.haml

SELECT `objectives`.* FROM `objectives` INNER JOIN `assignments` ON `objectives`.id = `assignments`.objective_id WHERE ((`assignments`.user_id = 4)) AND (objective_type = 'recurring' )
SELECT `users`.* FROM `users` WHERE (`users`.`id` = 3) LIMIT 1
---

	- if activity.target.present? && activity.target.is_a?( Checkin ) && activity.target.objective_assignment.present? && @current_user.children.include?( activity.user ) && activity.target.unapproved?
		.actions